org/lrn/forth/catch-and-throw.org
* CATCH и THROW

- Автор: Милендорф.М.
- Дата публикации: 1998г
- оригинал: http://www.complang.tuwien.ac.at/anton/euroforth/ef98/milendorf98.pdf
- Перевел: mOleg (http://www.fforum.winglion.ru/viewtopic.php?f=34&t=1632)
- Я внес некоторые исправления в перевод, опираясь на оригинал.

** Аннотация

CATCH и THROW механизм обработки исключений (нелокальный или многоуровневый выход
(EXIT)) наиболее глубокомысленная фундаментальная концепция добавленная в язык Форт, с
момента его создания Чаком Муром. Одновременно эта идея устройства и реализации
элегантна и органична Forth. Этот механизм так же прост в использовании при правильном
его понимании. Эта статья описывает историю создания CATCH и THROW , их реализацию,
синтаксис, семантику, и рациональные методы эффективного использования в сложных
многоуровневых Forth-системах, подобных OpenFirmaware.

** Благодарности

Специальные благодарности Вильяму Митч Бредли из FirmWorks за предоставление истории
его участия в CATCH и THROW, и за разрешение его включения в эту статью. Так же
благодарности Паулю Томасу из SunMicrosystems за его поддержку и разъяснения ANS Форт
определений слов ~ABORT~ и ~ABORT"~, и Роберту Хоуку из SunMicrosystems за тщательную
техническую рецензию статьи.

** История

Когда форт был изобретен, обработка исключений осталась за рамками языка. Механизм
поддержки исключений, определенный ANS, был предложен Вильямом Митч Бредли в 1990
году. В это время Бредли руководил созданием OpenBoot проекта в SunMicrosystems, и так
же являлся председателем комитета X3J14 ANS Форт технического комитета.

Перед тем, как он пришел с идеей, Бредли изучил все возможные схемы обработки
исключений в форте, опубликованные в то время. Он так же изучил схемы из различных
других языков (Си, Modula, Cedar, Lisp, PostScript). Обработка исключений в других
языках стилистически непротиворечива с ними. Например, обработка исключений Цедаре
включена в синтаксис языка и требует серьезной поддержки компилятора, не смотря на то,
что в Си ~setjmp()~ и ~longjmp()~ не требуют синтаксической поддержки компилятора, они
требуют от линкера умения разбирать буфер адресов переходов, который эффективнее
реализуется через глобальные переменные. Оба варианта близки общей идеологии этих
языков.

Бредли писал, что проблема с другими реализованными механизмами поддержки исключений в
Форте заключались в их инородности. Они основывались на комбинации синтаксических
элементов (префиксные операторы, определяющие слова, встроенные структуры управления)
или структур данных. Он понимал, что идеальным решением было бы создание открытого
примитива, который был бы обычным: не определяющим, не словом немедленного исполнения,
стековым словом.

Бредли хорошо помнит, что место в котором к нему в конце концов пришло озарение было
ванной в номере отеля. Это было утро встречи технического комитета создающего стандарт,
проходящего в NASA Goddard помещении в парке колледжа в 1990. Позднее в тот же день
Бредли объявил тему обработки исключений, которая тогда была одной из больных тем
комитета. Все знали, что стандарт должен содержать тему, но никто в реальности не имел
подходящих предложений. Проблема со сложными схемами, которая всегда поднималась в
комитетских дискуссиях, заключалась в возникновении проблематичных взаимодействий с
другими аспектами форта. В таких случаях дискуссии стремились сбиться в сторону и
затихнуть.

Позднее Бредли разработал детали реализации и показал, как просто вышло. Он начал
использовать механизм в различных местах OpenBoot, и опыт обнаружил, что механизм
работает очень хорошо. Он был особенно доволен тем, как гибка и масштабируема схема
применения ~CATCH~ и ~THROW~ получилась, но гораздо больше ожидал схода с пути, потому
что ключевое свойство в Forth - избежание синтаксической сложности приводит к
максимальной гибкости. После успешного опыта использования ~CATCH~ и ~THROW~ в
OpenBoot, который должен обеспечивать высокую надежность на широком спектре задач,
Бредли предложил свою модель обработки исключений ANS комитету. По его отзывам механизм
был поддержан сразу, по сравнению с аналогичными предложениями: без обычных перебранок,
криков и зубовного скрежета. Единственное изменение, внесенное комитетом в оригинальную
схему Брадли, заключается в том, что ~0 THROW~ работает как ~NOOP~ (то есть ничего не
делает). Это было решено после того, как решили использовать ~THROW~ после слов,
возвращающих результат завершения ввода/вывода ~ior~ ( код ~ior~ зависит от реализации
системы, в которой работает Forth). Фразы типа ~OPEN-FILE THROW~ очень удобны. Чуточку
позже комитет окончательно зафиксировал специфические значения кодов ошибок для
~THROW~.

Бредли заимствовал имена ~CATCH~ ~THROW~ из Lisp, в котором обработка ошибок ведется
методами очень похожими на ANS-евые CATCH и THROW Форта. Лисповские ~catch~ и ~throw~
"теггированные", что означает, если вы скажете ~(throw foo)~ это вызовет только
переключение ~catch~, который определяет тот же тэг ~foo~. Бредли раздумывал, делая
подобное с ~CATCH~ и ~THROW~ в Forth, где конкретный ~CATCH~ будет отвечать только на
конкретные значения ~THROW~, но он его отверг. Он написал примеры кода использующего
различную семантику, и нашел, что "ловим все, и делаем повторные THROW при
необходимости" семантика обеспечивает более чистый код почти в любом случае, особенно в
соединении с ~CASE~. С тех пор ~CATCH~ и ~THROW~ продолжали распространяться в исходных
OpenBoot текстах. OpenBoot использует то оригинальное определение ~CATCH~ и ~THROW~,
которое Бредли написал в 1990. ~CATCH~ и ~THROW~ так же стандарт в FCode. Эти FCode все
больше используются в диагностических прошивках для устройств ввода/вывода на платформе
SunMicrosysyems.

