www/lrn/forth/catch-and-throw.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">CATCH и THROW</a>
<ul>
<li><a href="#unnumbered-2">Аннотация</a></li>
<li><a href="#unnumbered-3">Благодарности</a></li>
<li><a href="#unnumbered-4">История</a></li>
<li><a href="#unnumbered-5">Синтаксис и семантика.</a></li>
<li><a href="#unnumbered-6">Реализация CATCH и THROW.</a></li>
<li><a href="#unnumbered-7">Коды исключений.</a></li>
<li><a href="#unnumbered-8">ABORT и ABORT".</a></li>
<li><a href="#unnumbered-9">Эффективное использование CATCH и THROW в программе.</a></li>
<li><a href="#unnumbered-10">Выводы.</a></li>
<li><a href="#unnumbered-11">Ссылки.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">CATCH и THROW</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<ul class="org-ul">
<li>Автор: Милендорф.М.
</li>
<li>Дата публикации: 1998г
</li>
<li>оригинал: <a href="http://www.complang.tuwien.ac.at/anton/euroforth/ef98/milendorf98.pdf">http://www.complang.tuwien.ac.at/anton/euroforth/ef98/milendorf98.pdf</a>
</li>
<li>Перевел: mOleg (<a href="http://www.fforum.winglion.ru/viewtopic.php?f=34&t=1632">http://www.fforum.winglion.ru/viewtopic.php?f=34&t=1632</a>)
</li>
<li>Я внес некоторые исправления в перевод, опираясь на оригинал.
</li>
</ul>
</div>

<div id="outline-container-unnumbered-2" class="outline-3">
<h3 id="unnumbered-2">Аннотация</h3>
<div class="outline-text-3" id="text-unnumbered-2">
<p>
CATCH и THROW механизм обработки исключений (нелокальный или многоуровневый выход
(EXIT)) наиболее глубокомысленная фундаментальная концепция добавленная в язык Форт, с
момента его создания Чаком Муром. Одновременно эта идея устройства и реализации
элегантна и органична Forth. Этот механизм так же прост в использовании при правильном
его понимании. Эта статья описывает историю создания CATCH и THROW , их реализацию,
синтаксис, семантику, и рациональные методы эффективного использования в сложных
многоуровневых Forth-системах, подобных OpenFirmaware.
</p>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-3">
<h3 id="unnumbered-3">Благодарности</h3>
<div class="outline-text-3" id="text-unnumbered-3">
<p>
Специальные благодарности Вильяму Митч Бредли из FirmWorks за предоставление истории
его участия в CATCH и THROW, и за разрешение его включения в эту статью. Так же
благодарности Паулю Томасу из SunMicrosystems за его поддержку и разъяснения ANS Форт
определений слов <code>ABORT</code> и ~ABORT"~, и Роберту Хоуку из SunMicrosystems за тщательную
техническую рецензию статьи.
</p>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-3">
<h3 id="unnumbered-4">История</h3>
<div class="outline-text-3" id="text-unnumbered-4">
<p>
Когда форт был изобретен, обработка исключений осталась за рамками языка. Механизм
поддержки исключений, определенный ANS, был предложен Вильямом Митч Бредли в 1990
году. В это время Бредли руководил созданием OpenBoot проекта в SunMicrosystems, и так
же являлся председателем комитета X3J14 ANS Форт технического комитета.
</p>

<p>
Перед тем, как он пришел с идеей, Бредли изучил все возможные схемы обработки
исключений в форте, опубликованные в то время. Он так же изучил схемы из различных
других языков (Си, Modula, Cedar, Lisp, PostScript). Обработка исключений в других
языках стилистически непротиворечива с ними. Например, обработка исключений Цедаре
включена в синтаксис языка и требует серьезной поддержки компилятора, не смотря на то,
что в Си <code>setjmp()</code> и <code>longjmp()</code> не требуют синтаксической поддержки компилятора, они
требуют от линкера умения разбирать буфер адресов переходов, который эффективнее
реализуется через глобальные переменные. Оба варианта близки общей идеологии этих
языков.
</p>

<p>
Бредли писал, что проблема с другими реализованными механизмами поддержки исключений в
Форте заключались в их инородности. Они основывались на комбинации синтаксических
элементов (префиксные операторы, определяющие слова, встроенные структуры управления)
или структур данных. Он понимал, что идеальным решением было бы создание открытого
примитива, который был бы обычным: не определяющим, не словом немедленного исполнения,
стековым словом.
</p>

<p>
Бредли хорошо помнит, что место в котором к нему в конце концов пришло озарение было
ванной в номере отеля. Это было утро встречи технического комитета создающего стандарт,
проходящего в NASA Goddard помещении в парке колледжа в 1990. Позднее в тот же день
Бредли объявил тему обработки исключений, которая тогда была одной из больных тем
комитета. Все знали, что стандарт должен содержать тему, но никто в реальности не имел
подходящих предложений. Проблема со сложными схемами, которая всегда поднималась в
комитетских дискуссиях, заключалась в возникновении проблематичных взаимодействий с
другими аспектами форта. В таких случаях дискуссии стремились сбиться в сторону и
затихнуть.
</p>

<p>
Позднее Бредли разработал детали реализации и показал, как просто вышло. Он начал
использовать механизм в различных местах OpenBoot, и опыт обнаружил, что механизм
работает очень хорошо. Он был особенно доволен тем, как гибка и масштабируема схема
применения <code>CATCH</code> и <code>THROW</code> получилась, но гораздо больше ожидал схода с пути, потому
что ключевое свойство в Forth - избежание синтаксической сложности приводит к
максимальной гибкости. После успешного опыта использования <code>CATCH</code> и <code>THROW</code> в
OpenBoot, который должен обеспечивать высокую надежность на широком спектре задач,
Бредли предложил свою модель обработки исключений ANS комитету. По его отзывам механизм
был поддержан сразу, по сравнению с аналогичными предложениями: без обычных перебранок,
криков и зубовного скрежета. Единственное изменение, внесенное комитетом в оригинальную
схему Брадли, заключается в том, что <code>0 THROW</code> работает как <code>NOOP</code> (то есть ничего не
делает). Это было решено после того, как решили использовать <code>THROW</code> после слов,
возвращающих результат завершения ввода/вывода <code>ior</code> ( код <code>ior</code> зависит от реализации
системы, в которой работает Forth). Фразы типа <code>OPEN-FILE THROW</code> очень удобны. Чуточку
позже комитет окончательно зафиксировал специфические значения кодов ошибок для
<code>THROW</code>.
</p>

<p>
Бредли заимствовал имена <code>CATCH</code> <code>THROW</code> из Lisp, в котором обработка ошибок ведется
методами очень похожими на ANS-евые CATCH и THROW Форта. Лисповские <code>catch</code> и <code>throw</code>
"теггированные", что означает, если вы скажете <code>(throw foo)</code> это вызовет только
переключение <code>catch</code>, который определяет тот же тэг <code>foo</code>. Бредли раздумывал, делая
подобное с <code>CATCH</code> и <code>THROW</code> в Forth, где конкретный <code>CATCH</code> будет отвечать только на
конкретные значения <code>THROW</code>, но он его отверг. Он написал примеры кода использующего
различную семантику, и нашел, что "ловим все, и делаем повторные THROW при
необходимости" семантика обеспечивает более чистый код почти в любом случае, особенно в
соединении с <code>CASE</code>. С тех пор <code>CATCH</code> и <code>THROW</code> продолжали распространяться в исходных
OpenBoot текстах. OpenBoot использует то оригинальное определение <code>CATCH</code> и <code>THROW</code>,
которое Бредли написал в 1990. <code>CATCH</code> и <code>THROW</code> так же стандарт в FCode. Эти FCode все
больше используются в диагностических прошивках для устройств ввода/вывода на платформе
SunMicrosysyems.
</p>
</div>
</div>
