org/lrn/forth/catch-and-throw.org
** Синтаксис и семантика.

В сущности, ~THROW~ - это ~ABORT~ (многоуровневый выход) и ~CATCH~ это "подтверждающая
ABORT" версия ~EXECUTE~. Если слово исполняется с помощью ~CATCH~, и во время
исполнения этого слова происходит ~THROW~ , стек возвратов остается нетронутым, стек
данных очищается, и управление передается в точку ~CATCH~. Если ~CATCH~ не был
использован, ~THROW~ откатится на самый верхний уровень , и программа будет выброшена
без шанса вмешаться в процесс восстановления. ANS Форт представляет ~CATCH~ и ~THROW~,
как часть опционального набора слов исключений:

9.6.1.0875 ~CATCH~ ( i*x xt -- j*x 0 | i*x n )

Поверхностное описание: исполнить команду определяемую ~xt~. Вернуть код THROW ~n~ .

ANS Форт описание: Создать фрейм исключения в стеке исключения и исполнить указанный
токен ~xt~ как с помощью ~EXECUTE~ таким образом, что контроль выполнения должен быть
передан в точку точно за ~CATCH~, если ~THROW~ произойдет во время исполнения ~xt~.

9.6.1.2275 ~THROW~ ( k*x n -- k*x | i*x n )

Поверхностное описание: Вернуться назад в ~CATCH~ обработчик, если код ~n~ не равен нулю.

ANS Форт описание: Если любые биты числа ~n~ не равны нулю, вытолкнуть верхний фрейм
исключения с вершины стека исключений вместе со всем, находящимся на стеке возвратов
выше этого фрейма. Затем восстановить входной поток на тот, что использовался во время
соответствующего ~CATCH~ и скорректировать глубины всех стеков, определенных
стандартом, так чтобы они имели те же глубины, что сохранены в фрейме исключений (~i~
это то же число входных аргументов, соответствующих началу выполнения ~CATCH~),
положить ~n~ на вершину стека данных, и передать управление в точку за ~CATCH~ который
сохранил фрейм исключения. Если вершина стека содержит отличное от нуля число и на
стеке исключений нет фрейма исключений, выполнить следующее: Если ~n = -1~, выполнить
функцию ~ABORT~. Если ~n = -2~ выполнить функцию ~ABORT"~. В других случаях система
может отображать зависимые от реализации сообщения, дающие информацию о состоянии
ассоциируемую с кодом ~n~. Затем система должна выполнить функцию ~ABORT~.

** Реализация CATCH и THROW.

Реализация Бредли слов CATCH и THROW очень проста для понимания.

CATCH сохраняет указатель стека данных, адрес предыдущего фрейма исключений на стеке
возвратов, и запоминает адрес текущего фрейма в глобальной переменной ~handler~. После
чего слово, описанное своим исполнимым адресом, исполняется. Если это слово исполняется
нормально (без исключений), управление возвращается к CATCH через обычный механизм
возврата, CATCH удаляет данные, положенные на стек возвратов, восстанавливает
переменную handler, кладет нуль на вершину стека данных на (примечание mOleg: место ~xt~), и передает
управление коду, стоящему за CATCH.

В другом случае, если THROW исполняется (с ненулевым аргументом), THROW определяет
ближайший вложенный CATCH фрейм (адрес которого лежит в ~handler~), очищает стек
возвратов до запомненного с помощью CATCH уровня, восстанавливает указатель стека
данных в сохраненное состояние в этом фрейме, копирует значение, вызвавшее THROW на
вершину стека данных, и возвращается на точку после CATCH (примечание mOleg: то есть
управление всегда и в любом случае возвращается в одну и ту же точку, расположенную за
CATCH). Когда CATCH возвращает нуль (имеется ввиду, что ~0 THROW~ было исполнено, или
что THROW не выполнялся вообще), состояние стеков такое же, как если бы вместо CATCH
использовалось слово EXECUTE. Когда CATCH возвращает ненулевое значение (то есть THROW
был вызван с ненулевым значением), глубина стека данных, не считая кода throw ,
сохраняется таким же, как до выполнения слова CATCH c его аргументом было
исполнено. Должно быть акцентировано, что только глубина стека восстанавливается, а не
его содержимое.

ANS Форт не требует использовать стек возвратов для реализации CATCH и THROW, но
использование стека возвратов выглядит натурально и используется в большинстве
систем. Предлагаемая реализация CATCH и THROW написана Митчем Бредли и сейчас
используется во всех работах OpenFirmware и SunMicrosystems OpenBoot
системах. Реализация использует нестандартные слова, описанные ниже. Эти слова или их
эквиваленты имеются во многих системах: ~sp@~ ~rp@~ ~sp!~ ~rp!~ (слова работают с
указателями вершин стеков данных и возвратов).

variable handler \ последний объявленный обработчик исключений
#+BEGIN_SRC forth
  : CATCH ( xt -- exception# | 0)
  \ адрес возврата уже на стеке
  sp@ >r        ( xt) \ сохранить указатель стека данных
  handler @ >r  ( xt) \ сохранить предыдущий обработчик
  rp@ handler ! ( xt) \ установить текущий обработчик
  execute       ( )   \ выполнить указанное xt
  r> handler !  ( )   \ восстановить предыдущий обработчик
  r> drop       ( )   \ удалить сохраненный указатель стека данных
  0             ( 0)  \ обозначить нормальное завершение
  ;

  : THROW ( ??? exception# -- ??? exception# ) \ возвращается в сохраненный контекст
  dup 0= if drop exit then \ выходим в случае, если флаг = 0
  handler @ rp!   ( exc#) \ восстанавливается указатель стека возвратов
  r> handler !    ( exc#) \ восстанавливается предыдущий обработчик
  r> swap >r  ( saved-sp) \ запомнить номер исключения на стек возвратов перед изменением стека данных
  sp! drop r>     ( exc#) \ восстановить указатель стек данных, вернуть код исключения
  ;
#+END_SRC

