www/lrn/forth/catch-and-throw.html

<div id="outline-container-unnumbered-5" class="outline-3">
<h3 id="unnumbered-5">Синтаксис и семантика.</h3>
<div class="outline-text-3" id="text-unnumbered-5">
<p>
В сущности, <code>THROW</code> - это <code>ABORT</code> (многоуровневый выход) и <code>CATCH</code> это "подтверждающая
ABORT" версия <code>EXECUTE</code>. Если слово исполняется с помощью <code>CATCH</code>, и во время
исполнения этого слова происходит <code>THROW</code> , стек возвратов остается нетронутым, стек
данных очищается, и управление передается в точку <code>CATCH</code>. Если <code>CATCH</code> не был
использован, <code>THROW</code> откатится на самый верхний уровень , и программа будет выброшена
без шанса вмешаться в процесс восстановления. ANS Форт представляет <code>CATCH</code> и <code>THROW</code>,
как часть опционального набора слов исключений:
</p>

<p>
9.6.1.0875 <code>CATCH</code> ( i*x xt &#x2013; j*x 0 | i*x n )
</p>

<p>
Поверхностное описание: исполнить команду определяемую <code>xt</code>. Вернуть код THROW <code>n</code> .
</p>

<p>
ANS Форт описание: Создать фрейм исключения в стеке исключения и исполнить указанный
токен <code>xt</code> как с помощью <code>EXECUTE</code> таким образом, что контроль выполнения должен быть
передан в точку точно за <code>CATCH</code>, если <code>THROW</code> произойдет во время исполнения <code>xt</code>.
</p>

<p>
9.6.1.2275 <code>THROW</code> ( k*x n &#x2013; k*x | i*x n )
</p>

<p>
Поверхностное описание: Вернуться назад в <code>CATCH</code> обработчик, если код <code>n</code> не равен нулю.
</p>

<p>
ANS Форт описание: Если любые биты числа <code>n</code> не равны нулю, вытолкнуть верхний фрейм
исключения с вершины стека исключений вместе со всем, находящимся на стеке возвратов
выше этого фрейма. Затем восстановить входной поток на тот, что использовался во время
соответствующего <code>CATCH</code> и скорректировать глубины всех стеков, определенных
стандартом, так чтобы они имели те же глубины, что сохранены в фрейме исключений (<code>i</code>
это то же число входных аргументов, соответствующих началу выполнения <code>CATCH</code>),
положить <code>n</code> на вершину стека данных, и передать управление в точку за <code>CATCH</code> который
сохранил фрейм исключения. Если вершина стека содержит отличное от нуля число и на
стеке исключений нет фрейма исключений, выполнить следующее: Если <code>n = -1</code>, выполнить
функцию <code>ABORT</code>. Если <code>n = -2</code> выполнить функцию ~ABORT"~. В других случаях система
может отображать зависимые от реализации сообщения, дающие информацию о состоянии
ассоциируемую с кодом <code>n</code>. Затем система должна выполнить функцию <code>ABORT</code>.
</p>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-3">
<h3 id="unnumbered-6">Реализация CATCH и THROW.</h3>
<div class="outline-text-3" id="text-unnumbered-6">
<p>
Реализация Бредли слов CATCH и THROW очень проста для понимания.
</p>

<p>
CATCH сохраняет указатель стека данных, адрес предыдущего фрейма исключений на стеке
возвратов, и запоминает адрес текущего фрейма в глобальной переменной <code>handler</code>. После
чего слово, описанное своим исполнимым адресом, исполняется. Если это слово исполняется
нормально (без исключений), управление возвращается к CATCH через обычный механизм
возврата, CATCH удаляет данные, положенные на стек возвратов, восстанавливает
переменную handler, кладет нуль на вершину стека данных на (примечание mOleg: место <code>xt</code>), и передает
управление коду, стоящему за CATCH.
</p>

<p>
В другом случае, если THROW исполняется (с ненулевым аргументом), THROW определяет
ближайший вложенный CATCH фрейм (адрес которого лежит в <code>handler</code>), очищает стек
возвратов до запомненного с помощью CATCH уровня, восстанавливает указатель стека
данных в сохраненное состояние в этом фрейме, копирует значение, вызвавшее THROW на
вершину стека данных, и возвращается на точку после CATCH (примечание mOleg: то есть
управление всегда и в любом случае возвращается в одну и ту же точку, расположенную за
CATCH). Когда CATCH возвращает нуль (имеется ввиду, что <code>0 THROW</code> было исполнено, или
что THROW не выполнялся вообще), состояние стеков такое же, как если бы вместо CATCH
использовалось слово EXECUTE. Когда CATCH возвращает ненулевое значение (то есть THROW
был вызван с ненулевым значением), глубина стека данных, не считая кода throw ,
сохраняется таким же, как до выполнения слова CATCH c его аргументом было
исполнено. Должно быть акцентировано, что только глубина стека восстанавливается, а не
его содержимое.
</p>

<p>
ANS Форт не требует использовать стек возвратов для реализации CATCH и THROW, но
использование стека возвратов выглядит натурально и используется в большинстве
систем. Предлагаемая реализация CATCH и THROW написана Митчем Бредли и сейчас
используется во всех работах OpenFirmware и SunMicrosystems OpenBoot
системах. Реализация использует нестандартные слова, описанные ниже. Эти слова или их
эквиваленты имеются во многих системах: <code>sp@</code> <code>rp@</code> <code>sp!</code> <code>rp!</code> (слова работают с
указателями вершин стеков данных и возвратов).
</p>

<p>
variable handler \ последний объявленный обработчик исключений
</p>
<div class="org-src-container">

<pre class="src src-forth">: CATCH <span style="color: #af0000;">( xt -- exception# | 0)</span>
<span style="color: #af0000;">\ &#1072;&#1076;&#1088;&#1077;&#1089; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1091;&#1078;&#1077; &#1085;&#1072; &#1089;&#1090;&#1077;&#1082;&#1077;
</span>sp@ &gt;r        <span style="color: #af0000;">( xt)</span> <span style="color: #af0000;">\ &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
</span>handler @ &gt;r  <span style="color: #af0000;">( xt)</span> <span style="color: #af0000;">\ &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;
</span>rp@ handler ! <span style="color: #af0000;">( xt)</span> <span style="color: #af0000;">\ &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;
</span>execute       <span style="color: #af0000;">( )</span>   <span style="color: #af0000;">\ &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; xt
</span>r&gt; handler !  <span style="color: #af0000;">( )</span>   <span style="color: #af0000;">\ &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;
</span>r&gt; drop       <span style="color: #af0000;">( )</span>   <span style="color: #af0000;">\ &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
</span><span style="color: #008787;">0 </span>            ( 0)  <span style="color: #af0000;">\ &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1077;
</span><span style="color: #af00ff;">;</span>

<span style="color: #af00ff;">: </span><span style="color: #0000ff;">THROW </span>( ??? exception# -- ??? exception# ) <span style="color: #af0000;">\ &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;
</span>dup 0= <span style="color: #af00ff;">if </span>drop exit then <span style="color: #af0000;">\ &#1074;&#1099;&#1093;&#1086;&#1076;&#1080;&#1084; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1075; = 0
</span>handler @ rp!   <span style="color: #af0000;">( exc#)</span> <span style="color: #af0000;">\ &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1086;&#1074;
</span>r&gt; handler !    <span style="color: #af0000;">( exc#)</span> <span style="color: #af0000;">\ &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;
</span>r&gt; swap &gt;r  <span style="color: #af0000;">( saved-sp)</span> <span style="color: #af0000;">\ &#1079;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100; &#1085;&#1086;&#1084;&#1077;&#1088; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1089;&#1090;&#1077;&#1082; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1086;&#1074; &#1087;&#1077;&#1088;&#1077;&#1076; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1077;&#1082;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
</span>sp! drop r&gt;     <span style="color: #af0000;">( exc#)</span> <span style="color: #af0000;">\ &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1082;&#1086;&#1076; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103;
</span><span style="color: #af00ff;">;</span>
</pre>
</div>
</div>
</div>
