www/lrn/forth/catch-and-throw.html

<div id="outline-container-unnumbered-7" class="outline-3">
<h3 id="unnumbered-7">Коды исключений.</h3>
<div class="outline-text-3" id="text-unnumbered-7">
<p>
Коды исключений согласно ANS могут выбираться только из определенных диапазонов для
избегания конфликтов при переносе кода между разными форт-системами и
приложениями. Значения {-255..-1} могут быть использованы только так, как описано в
стандарте. Значения {-4095..-256} могут использоваться только так, как определено в
системе. Программы не должны определять значения для использования вместе с THROW в
перечисленных диапазонах. Стандарт фиксирует коды исключений в диапазоне {-58 &#x2026; -1}
предназначенные для различных обработчиков исключений и ошибок (-1 зарезервирован за
ABORT, а -2 за ABORT" , -3 за переполнением стека данных, -4 за переопустошением стека
данных и так далее).
</p>
</div>
</div>

<div id="outline-container-unnumbered-8" class="outline-3">
<h3 id="unnumbered-8">ABORT и ABORT".</h3>
<div class="outline-text-3" id="text-unnumbered-8">
<p>
<code>ABORT</code> и ~ABORT"~ существовали в форте до появления механизма обработки исключений,
который появился в 1990. (примечание mOleg: строго говоря в старых фортах слово ABORT -
было бесконечным циклом, внутри которого работал цикл <code>QUIT</code>, поэтому многоуровневым
выходом его можно на мой взгляд считать с натяжкой), в то время как ~ABORT"~
многоуровневый выход с ассоциируемым сообщением. Синтаксис и семантика для них в
стандарте следующие:
</p>

<p>
6.1.0670 <code>ABORT</code> ( i*x &#x2013; ) ( R: j*x &#x2013; )
</p>

<p>
ANS: Очистить стек данных и выполнить функцию QUIT, которая включает очистку стека
возвратов без отображения сообщения.
</p>

<p>
6.1.0680 ~ABORT"~ ( i*x flag &#x2013; | i*x ) ( R: j*x &#x2013; |j*x ) Compilation: ( “ ccc” &#x2013; )
</p>

<p>
ANS: удалить флаг с вершины стека данных, если любой из битов значения <code>flag</code> отличны
от нуля, отобразить строку <code>ccc</code> и выполнить зависящую от реализации последовательность
ABORT.
</p>

<p>
В дополнение, ANS Форт определяет две другие версии этих слов, для систем, которые
вобрали в себя слова CATCH и THROW. Эти "более мощные" версии <code>ABORT</code> , ~ABORT"~
присутствуют как часть опциональной поддержки исключений:
</p>

<p>
9.6.2.0670 ABORT ( i*x &#x2013; ) ( R: j*x &#x2013; )
</p>

<p>
ANS: выполнить функцию -1 THROW.
</p>

<p>
Мы должны согласиться, что это не очень чистое определение слова ABORT. Что оно
означает ABORT заменяется до -1 THROW , и упрощает восстановление ошибок. Использование
CATCH и THROW позволяет программе выполнять более разумные действия при возникновении
ошибок, а так же позволяет различное поведение ABORT в зависимости от того, как оно
определено.
</p>

<p>
9.6.2.0680 ABORT” ( i*x flag &#x2013; | i*x ) ( R: j*x &#x2013; |j*x ) Compilation: ( “ ccc” &#x2013; )
</p>

<p>
ANS: убрать flag, если любой из битов флага отличны от нуля, выполнить -2 THROW ,
отображающее строку ccc если ошибка дошла до базового обработчика исключений (CATCH).
</p>

<p>
Стандарт определяет ~ABORT"~ потому что программисты хотят его использовать, но не
всегда хотят видеть текст сообщения, особенно для встраиваемых приложений, где не
всегда дисплей имеется. Для отладки на больших системах отображение сообщений
приветствуются. Так же сообщения могут сохраняться в историю (log), или могут
отображаться отложено, или могут быть переведены на другой язык, после чего
отображены. Комитет пришел к выводу, что в случае использования механизма исключений
возможно вмешательство в процесс вывода сообщений, идея понравилась.
</p>

<p>
В дополнение к 9.6.2.0680 определению слова ~ABORT"~ возможны три различные методики
реализации ABORT":
</p>
<ul class="org-ul">
<li>~ABORT"~ сначала отображает сообщение, затем выполняет -2 THROW
</li>
<li>~ABORT"~ сохраняет строку сообщения в буфер, затем выполняет -2 THROW, CATCH-ер
отображает текст
</li>
<li>~ABORT"~ сохраняет строку сообщения в буфер, затем выполняет -2 THROW, CATCH-ер не
отображает текст
</li>
</ul>
</div>
</div>
