org/lrn/forth/catch-and-throw.org
** Эффективное использование CATCH и THROW в программе.

Как упоминалось ранее, Бредли рассматривал создание THROW только для реагирования на
особенные коды исключений, но решился отказаться от этого. Он обнаружил, что "ловить
все и передавать дальше при необходимости" семантика обеспечивает более прозрачный код
практически в любом случае, особенно в сочетании с конструкцией CASE. Это должно быть
легко понятно. Вспомните, что CATCH всегда ловит все THROW, инициированные как
программным кодом так и самой системой. Поэтому, ловля и повторный вызов исключений с
тем же кодом исключения может заменить запланированную обработку исключений в Форт
системе, в случае ошибки или исключения. В дополнение, перехват системных кодов или
абортов позволяет для некоторых Форт-систем не отображать при необходимости сообщения:

#+BEGIN_SRC forth
  : foo ( -- ) ... 10 THROW ; \ где-то в коде
  ['] foo CATCH ?dup if ... then \ дырявый обработчик
#+END_SRC

Хотя этот пример может выглядеть корректным, в реальности это не правило кодирования.
Вступление было сделано, что только тот THROW будет пойман, который находится в слове
foo, и имеет код 10. С этой предпосылкой программа только проверяет, отлично ли
значение от нуля, и предполагает, что, если отлично от нуля, то это значение 10 из
foo. Неверно! Что, если во время исполнения слова foo, Форт система сгенерирует
системный THROW с одним из зарезервированных кодов THROW? В таком случае системный
THROW, инициированный системой (например, переполнение стека код: -3) будет пойман в
приложении вызывающем foo, и выполнение программы будет продолжено с точки CATCH (с,
возможно, подпорченным стеком данных), в замену выхода на более высокий уровень для
вывода сообщения об ошибке, как это раньше предполагалось в системе. Учитывая
описанное, корректное решение будет в проверке пойманного кода THROW на знакомство
этого кода программе. В последствии повторно вызвать исключение с любым неизвестным
программе кодом, передавая исключение выше:

#+BEGIN_SRC forth
  ['] foo CATCH dup 10 = if ( 10|n) \ проверка, равен ли код 10
  ... ( 10) \ если равен, обрабатываем известный код
  else ( n) \ иначе
  THROW ( ) \ передаем исключение выше
  then \ 0 THROW выполнит noop
#+END_SRC

Если необходимо обработать больше значений кодов, лучший выход использовать CASE
структуру следующим образом:

#+BEGIN_SRC forth
  ['] foo CATCH
  case
  10 of .... endof \ реакция на код = 10
  20 of .... endof \ реакция на код = 20
  40 of .... endof \ реакция на код = 40
  dup THROW \ передача неизвестного кода выше
  endcase \ 0 THROW выполнит noop
#+END_SRC

С этой предлагаемой программной техникой использование CATCH в приложении никогда не
навредит. Другое требование для эффективного использования CATCH и THROW - никогда не
использовать значения кодов исключений зарезервированные в системе для внутренних
нужд. В большинстве случаев приложение должно использовать только маленькие
положительные числа для кодов исключений, только согласно предписанию
стандарта. Интересным вариантом использования THROW - использование адреса памяти как
кода исключения. Этот адрес памяти может содержать сжатую строку (текстовое сообщение),
соответствующее ошибке:

#+BEGIN_SRC forth
  ok : foo ( -- ) ... p” XXX” THROW ;
  ok ['] foo CATCH ( paddr ) .error
  ok XXX
#+END_SRC

В этом примере значение THROW, возвращаемое CATCH - это адрес строки, содержащей
сообщение "XXX". Слово .error должно определить, является ли код исключения
действительным адресом в памяти, и выполняет ~COUTN TYPE~, которые выводят
сообщение. Количество различных типов значений кодов может быть использовано в
программе: (1) положительные коды ошибок, (2) положительные коды ошибок для выбора с
помощью CASE, (3) маленькое положительное число для выбора сообщения из списка
сообщений, (4) адрес в памяти, содержащий строку сообщения, (5) исполнимый адрес или
другой адрес в памяти.

Другое наблюдение - не стоит очищать стеки данных и возвратов в большинстве систем
перед исполнением THROW:

#+BEGIN_SRC forth
  ok : foo ( -- ) 1 >r 2 >r 3 4 5 THROW ; ( )
  ok [‘] foo CATCH ( 5 )
#+END_SRC

Часто предполагается, что CATCH и THROW механизм должен использоваться только для
обработки ошибок. Хотя, конечно, обработка ошибок - это главное назначение механизма,
CATCH и THROW можно использовать так же для эффективного программирования, когда
многоуровневый выход делает программы проще.

** Выводы.

Не смотря на многочисленные механизмы появлявшиеся до и после создания CATCH и THROW,
по нашему мнению именно этот механизм отвечает идеологии Forth. Механизм доказал свою
эффективность в различных Forth-системах и приложениях (таких как OpenFirmware,
OpenBoot и FCODE драйверах). Очень важно следовать стандарту при обработке кодов
исключений в программе, и осторожно обрабатывать каждое CATCH, помня, что любое
исключение может быть поймано любым обработчиком в программе. Стандарт определяет два
набора слов: ~ABORT~ , ~ABORT"~ заботясь о обработке аварийных прекращений. Один является
частью ~THE CORE WORD SET~ (которые не используют THROW), и другой является частью ~THE
OPTIONAL EXCEPTION WORD SET~ (с использованием THROW). Последний набор позволяет гибко и
просто обрабатывать ошибки, используя ~CATCH~ для обработки поведения ~ABORT~ и ~ABORT"~.

** Ссылки.

[ 1] ANSI X3.215-1994 ANS for Information Systems - Programming Languages - Forth
[ 2] IEEE Standard 1275-1994; Standard for Boot Firmware: Core Requirements & Practices
[ 3] Gassanenko, M.L., Extension of the Exception Handling Mechanism, Euroforth95
[ 4] Rodriguez, B.J., A Forth Extension Handler, SIGForth, Vol. 1, Summer’89, p. 11-13
[ 5] Wejgaard, W., TRY: A Simple Exception Handler, EuroFORML ‘91, p.4
[ 6] Clifton, G., Terry, R., Exception Handling in Forth, Rochester Forth Conference ‘85
[ 7] Woehr, J., Forth: The New Model, M&T Books, 1992

(примечание mOleg: - так в скобках обозначены коментарии переводчика)
