www/lrn/forth/catch-and-throw.html

<div id="outline-container-unnumbered-9" class="outline-3">
<h3 id="unnumbered-9">Эффективное использование CATCH и THROW в программе.</h3>
<div class="outline-text-3" id="text-unnumbered-9">
<p>
Как упоминалось ранее, Бредли рассматривал создание THROW только для реагирования на
особенные коды исключений, но решился отказаться от этого. Он обнаружил, что "ловить
все и передавать дальше при необходимости" семантика обеспечивает более прозрачный код
практически в любом случае, особенно в сочетании с конструкцией CASE. Это должно быть
легко понятно. Вспомните, что CATCH всегда ловит все THROW, инициированные как
программным кодом так и самой системой. Поэтому, ловля и повторный вызов исключений с
тем же кодом исключения может заменить запланированную обработку исключений в Форт
системе, в случае ошибки или исключения. В дополнение, перехват системных кодов или
абортов позволяет для некоторых Форт-систем не отображать при необходимости сообщения:
</p>

<div class="org-src-container">

<pre class="src src-forth">: foo ( -- ) ... 10 THROW ; <span style="color: #af0000;">\ &#1075;&#1076;&#1077;-&#1090;&#1086; &#1074; &#1082;&#1086;&#1076;&#1077;
</span><span style="color: #ff0000; font-weight: bold;">['] </span><span style="color: #0000ff;">foo </span>CATCH ?dup if ... then <span style="color: #af0000;">\ &#1076;&#1099;&#1088;&#1103;&#1074;&#1099;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;
</span>
</pre>
</div>

<p>
Хотя этот пример может выглядеть корректным, в реальности это не правило кодирования.
Вступление было сделано, что только тот THROW будет пойман, который находится в слове
foo, и имеет код 10. С этой предпосылкой программа только проверяет, отлично ли
значение от нуля, и предполагает, что, если отлично от нуля, то это значение 10 из
foo. Неверно! Что, если во время исполнения слова foo, Форт система сгенерирует
системный THROW с одним из зарезервированных кодов THROW? В таком случае системный
THROW, инициированный системой (например, переполнение стека код: -3) будет пойман в
приложении вызывающем foo, и выполнение программы будет продолжено с точки CATCH (с,
возможно, подпорченным стеком данных), в замену выхода на более высокий уровень для
вывода сообщения об ошибке, как это раньше предполагалось в системе. Учитывая
описанное, корректное решение будет в проверке пойманного кода THROW на знакомство
этого кода программе. В последствии повторно вызвать исключение с любым неизвестным
программе кодом, передавая исключение выше:
</p>

<div class="org-src-container">

<pre class="src src-forth">['] foo CATCH dup 10 = if ( 10|n) <span style="color: #af0000;">\ &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072;, &#1088;&#1072;&#1074;&#1077;&#1085; &#1083;&#1080; &#1082;&#1086;&#1076; 10
</span>... <span style="color: #af0000;">( 10)</span> <span style="color: #af0000;">\ &#1077;&#1089;&#1083;&#1080; &#1088;&#1072;&#1074;&#1077;&#1085;, &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;
</span><span style="color: #ff0000; font-weight: bold;">else </span>( n) <span style="color: #af0000;">\ &#1080;&#1085;&#1072;&#1095;&#1077;
</span>THROW <span style="color: #af0000;">( )</span> <span style="color: #af0000;">\ &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1084; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1096;&#1077;
</span><span style="color: #ff0000; font-weight: bold;">then </span><span style="color: #af0000;">\ 0 THROW &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090; noop
</span>
</pre>
</div>

<p>
Если необходимо обработать больше значений кодов, лучший выход использовать CASE
структуру следующим образом:
</p>

<div class="org-src-container">

<pre class="src src-forth"><span style="color: #ff0000; font-weight: bold;">['] </span><span style="color: #0000ff;">foo </span>CATCH
<span style="color: #ff0000; font-weight: bold;">case</span>
<span style="color: #008787;">10 </span>of .... endof <span style="color: #af0000;">\ &#1088;&#1077;&#1072;&#1082;&#1094;&#1080;&#1103; &#1085;&#1072; &#1082;&#1086;&#1076; = 10
</span><span style="color: #008787;">20 </span>of .... endof <span style="color: #af0000;">\ &#1088;&#1077;&#1072;&#1082;&#1094;&#1080;&#1103; &#1085;&#1072; &#1082;&#1086;&#1076; = 20
</span><span style="color: #008787;">40 </span>of .... endof <span style="color: #af0000;">\ &#1088;&#1077;&#1072;&#1082;&#1094;&#1080;&#1103; &#1085;&#1072; &#1082;&#1086;&#1076; = 40
</span>dup THROW <span style="color: #af0000;">\ &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1085;&#1077;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1074;&#1099;&#1096;&#1077;
</span><span style="color: #ff0000; font-weight: bold;">endcase </span><span style="color: #af0000;">\ 0 THROW &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090; noop
</span>
</pre>
</div>

<p>
С этой предлагаемой программной техникой использование CATCH в приложении никогда не
навредит. Другое требование для эффективного использования CATCH и THROW - никогда не
использовать значения кодов исключений зарезервированные в системе для внутренних
нужд. В большинстве случаев приложение должно использовать только маленькие
положительные числа для кодов исключений, только согласно предписанию
стандарта. Интересным вариантом использования THROW - использование адреса памяти как
кода исключения. Этот адрес памяти может содержать сжатую строку (текстовое сообщение),
соответствующее ошибке:
</p>

<div class="org-src-container">

<pre class="src src-forth">ok : foo ( -- ) ... p&#8221; XXX&#8221; THROW <span style="color: #af00ff;">;</span>
ok <span style="color: #ff0000; font-weight: bold;">['] </span><span style="color: #0000ff;">foo </span>CATCH <span style="color: #af0000;">( paddr )</span> .error
ok XXX
</pre>
</div>

<p>
В этом примере значение THROW, возвращаемое CATCH - это адрес строки, содержащей
сообщение "XXX". Слово .error должно определить, является ли код исключения
действительным адресом в памяти, и выполняет <code>COUTN TYPE</code>, которые выводят
сообщение. Количество различных типов значений кодов может быть использовано в
программе: (1) положительные коды ошибок, (2) положительные коды ошибок для выбора с
помощью CASE, (3) маленькое положительное число для выбора сообщения из списка
сообщений, (4) адрес в памяти, содержащий строку сообщения, (5) исполнимый адрес или
другой адрес в памяти.
</p>

<p>
Другое наблюдение - не стоит очищать стеки данных и возвратов в большинстве систем
перед исполнением THROW:
</p>

<div class="org-src-container">

<pre class="src src-forth">ok : foo ( -- ) 1 &gt;r 2 &gt;r 3 4 5 THROW ; <span style="color: #af0000;">( )</span>
ok <span style="color: #af00ff;">[&#8216;] </span>foo CATCH <span style="color: #af0000;">( 5 )</span>
</pre>
</div>

<p>
Часто предполагается, что CATCH и THROW механизм должен использоваться только для
обработки ошибок. Хотя, конечно, обработка ошибок - это главное назначение механизма,
CATCH и THROW можно использовать так же для эффективного программирования, когда
многоуровневый выход делает программы проще.
</p>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-3">
<h3 id="unnumbered-10">Выводы.</h3>
<div class="outline-text-3" id="text-unnumbered-10">
<p>
Не смотря на многочисленные механизмы появлявшиеся до и после создания CATCH и THROW,
по нашему мнению именно этот механизм отвечает идеологии Forth. Механизм доказал свою
эффективность в различных Forth-системах и приложениях (таких как OpenFirmware,
OpenBoot и FCODE драйверах). Очень важно следовать стандарту при обработке кодов
исключений в программе, и осторожно обрабатывать каждое CATCH, помня, что любое
исключение может быть поймано любым обработчиком в программе. Стандарт определяет два
набора слов: <code>ABORT</code> , <code>ABORT"~ заботясь о обработке аварийных прекращений. Один является
частью ~THE CORE WORD SET</code> (которые не используют THROW), и другой является частью <code>THE
OPTIONAL EXCEPTION WORD SET</code> (с использованием THROW). Последний набор позволяет гибко и
просто обрабатывать ошибки, используя <code>CATCH</code> для обработки поведения <code>ABORT</code> и ~ABORT"~.
</p>
</div>
</div>

<div id="outline-container-unnumbered-11" class="outline-3">
<h3 id="unnumbered-11">Ссылки.</h3>
<div class="outline-text-3" id="text-unnumbered-11">
<p>
[ 1] ANSI X3.215-1994 ANS for Information Systems - Programming Languages - Forth
[ 2] IEEE Standard 1275-1994; Standard for Boot Firmware: Core Requirements &amp; Practices
[ 3] Gassanenko, M.L., Extension of the Exception Handling Mechanism, Euroforth95
[ 4] Rodriguez, B.J., A Forth Extension Handler, SIGForth, Vol. 1, Summer’89, p. 11-13
[ 5] Wejgaard, W., TRY: A Simple Exception Handler, EuroFORML ‘91, p.4
[ 6] Clifton, G., Terry, R., Exception Handling in Forth, Rochester Forth Conference ‘85
[ 7] Woehr, J., Forth: The New Model, M&amp;T Books, 1992
</p>

<p>
(примечание mOleg: - так в скобках обозначены коментарии переводчика)
</p>
</div>
</div>
</div>
</div>
</body>
</html>
